my_list = ("", "Зима", "Весна", "Лето", "Осень")
my_dict={1: "Зима", 2: "Весна", 3: "Лето", 4: "Осень"}
while True:
    m = input("Введите номер месяца: ")
    if m == "":
        print("Пустой ввод. Повторите ввод.")
    elif m not in ('1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12'):
        print("Некорректный ввод. Повторите ввод.")
    else:
        break
q = 0
if m == "12":
    q = 1
else:
    q = int(m)//3 + 1
print(f'Месяц {m} - {my_list[q]}')
print(f'Месяц {m} - {my_dict.get(q)}')